In [300]:
### Extra code to reuse

## Exporting data to CSV
# combined_data.to_csv('file_name.csv')

## Finding what the Data Type a column is.
# data_type = IMDb_Basics['isAdult'].dtype
# print(data_type)

## Filtering dataframes for a specific values
# filtered_df = IMDB_Basics[IMDB_Basics['primaryTitle'].str.contains('Bond', case=False, na=False)]
# print(filtered_df)

# Optionally save the combined dataframe to a new CSV file
# output_file = path_to_files + 'combined_data.csv'
# combined_df.to_csv(output_file, index=False)
# print(f"Combined CSV saved to {output_file}")

# Importing all Datasets

In [301]:
import os
import glob
import math
import numpy as np
import pandas as pd
from datetime import datetime

os.chdir('/Users/shreyashgupta/Library/CloudStorage/OneDrive-UniversityofArkansas/MSEA/ECON 5813 - Economic Analytics I/Project Proposal/Data')

# 1: Stocks
Amazon_Stock = pd.read_csv('Amazon Stock.csv')
Apple_Stock = pd.read_csv('Apple Stock.csv')
ATT_Stock = pd.read_csv('AT&T Stock.csv')
Comcast_Stock = pd.read_csv('Comcast Stock.csv')
Lions_Gate_Entertainment_Historical = pd.read_csv('Lions Gate Entertainment Historical.csv')
Lions_Gate_Historical = pd.read_csv('Lions Gate Historical.csv')
Netflix_Stock_Data = pd.read_csv('Netflix Stock Data.csv')
Paramount_Global_Historical_Prices = pd.read_csv('Paramount Global Historical Prices.csv')
Sony_Stock = pd.read_csv('Sony Stock.csv')
The_Walt_Disney_Company_Historical_Prices = pd.read_csv('The Walt Disney Company Historical Prices.csv')
Warner_Bros_Discovery = pd.read_csv('Warner Bros Discovery.csv')
Vanguard_500_Historical = pd.read_csv('Vanguard 500 Historical.csv')

#############

# 2: Economic Indicators 
GDP = pd.read_csv('GDP.csv') # Billions of Dollars & Seasonally Adjusted Annual Rate
Unemployment_Rate = pd.read_csv('Unemployment Rate US.csv') # This is Percent & Seasonally Adjusted

#############

# 3. IMDB Data -- More about the dataset below in markdown
IMDb_Basics = pd.read_csv('IMDb Basics.tsv', sep='\t')
IMDb_Name_Basics = pd.read_csv('IMDb Name Basics.tsv', sep='\t')
IMDb_Ratings = pd.read_csv('IMDb Ratings.tsv', sep='\t')
IMDb_Title_Akas = pd.read_csv('IMDb Title Akas.tsv', sep='\t')
IMDb_Title_Crew = pd.read_csv('IMDb Title Crew.tsv', sep='\t')
Title_Episode = pd.read_csv('Title Episode.tsv', sep='\t')
Title_Principals = pd.read_csv('Title Principals.tsv', sep='\t')

#############

# 4: Gross Movie revenue data
# Function to try multiple date formats
def parse_dates(date):
    for fmt in ('%d-%b', '%Y-%m-%d', '%m/%d/%Y', '%d/%m/%Y'):  # Add or modify formats as needed
        try:
            return pd.to_datetime(date, format=fmt)
        except ValueError:
            continue
    # Return the original date if no format matched
    return pd.NaT

# Path to the directory where all your CSV files are stored
path_to_files = '/Users/shreyashgupta/Library/CloudStorage/OneDrive-UniversityofArkansas/MSEA/ECON 5813 - Economic Analytics I/Project Proposal/Data/Gross Data/'

# Use glob to match the pattern for all CSV files. The * wildcard will match any characters
file_pattern = path_to_files + '/* *.csv'
file_list = glob.glob(file_pattern)

# Create an empty list to hold your dataframes
dataframes_list = []

# Loop over the list of file paths & names
for file_name in file_list:
    # Read the current file into a dataframe
    df = pd.read_csv(file_name)
    
    # Extract month and year from the filename to create a new 'Date' column if needed
    # This can help if the 'Release Date' column isn't consistent
    month_year = file_name.split('/')[-1].replace('.csv', '')
    try:
        # Trying to convert 'month year' to a datetime object, assuming format 'Month YYYY'
        df['Date'] = datetime.strptime(month_year, '%B %Y')
    except ValueError:
        print(f"Skipping file {file_name}: Date format issue")
        continue
    
    # Append the dataframe to the list
    dataframes_list.append(df)

# Combine all dataframes into one
Movie_Revenues = pd.concat(dataframes_list, ignore_index=True)

# Apply the custom date parser to the 'Release Date' column
Movie_Revenues['Release Date'] = Movie_Revenues['Release Date'].apply(parse_dates)

# Now, sort by 'Release Date' if possible, otherwise, by the new 'Date' column
if Movie_Revenues['Release Date'].isnull().all():
    Movie_Revenues = Movie_Revenues.sort_values('Date')
else:
    Movie_Revenues = Movie_Revenues.sort_values('Release Date')

/var/folders/7_/z9jxc0jj6fx4snlcjg1wby4r0000gn/T/ipykernel_2075/3883758322.py:33: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  IMDb_Basics = pd.read_csv('IMDb Basics.tsv', sep='\t')
/var/folders/7_/z9jxc0jj6fx4snlcjg1wby4r0000gn/T/ipykernel_2075/3883758322.py:36: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  IMDb_Title_Akas = pd.read_csv('IMDb Title Akas.tsv', sep='\t')

---------------

# Modeling Stocks Data

In [302]:
# Adding company to each individual stick dataframe to the respective company name.
Amazon_Stock['Company'] = 'Amazon'
Apple_Stock['Company'] = 'Apple'
ATT_Stock['Company'] = 'AT&T'
Comcast_Stock['Company'] = 'Comcast'
Lions_Gate_Entertainment_Historical['Company'] = 'Lions Gate Entertainment' #look into the 2 lionsgate datasets I have and what problems it could create.
Lions_Gate_Historical['Company'] = 'Lions Gate'
Netflix_Stock_Data['Company'] = 'Netflix'
Paramount_Global_Historical_Prices['Company'] = 'Paramount Global'
Sony_Stock['Company'] = 'Sony'
The_Walt_Disney_Company_Historical_Prices['Company'] = 'Walt Disney'
Warner_Bros_Discovery['Company'] = 'Warner Bros Discovery'
Vanguard_500_Historical['Company'] = 'Vanguard_500_Historical'

# Convert 'Date' columns to datetime for all dataframes before merging
# Note: If your date formats are inconsistent, you may need to handle them individually.
company_stocks = [Amazon_Stock, Apple_Stock, ATT_Stock, Comcast_Stock, Lions_Gate_Entertainment_Historical, Lions_Gate_Historical, Netflix_Stock_Data, Paramount_Global_Historical_Prices, Sony_Stock, The_Walt_Disney_Company_Historical_Prices, Warner_Bros_Discovery, Vanguard_500_Historical]

for stock_df in company_stocks:
    stock_df['Date'] = pd.to_datetime(stock_df['Date'])

# Define the list of company names
company_names = ['Amazon', 'Apple', 'AT&T', 'Comcast', 'Lions Gate Entertainment', 'Lions Gate', 'Netflix', 'Paramount Global', 'Sony', 'Walt Disney', 'Warner Bros Discovery', 'Vanguard 500']

# Initialize the combined DataFrame
all_stocks = pd.DataFrame()

# Loop through each company DataFrame
for stock_df, company_name in zip(company_stocks, company_names):
    # Rename columns to include the company name (excluding 'Date')
    cols_to_rename = {col: f"{col}_{company_name}" for col in stock_df.columns if col != 'Date'}
    df_renamed = stock_df.rename(columns=cols_to_rename)
    
    # Merge with the combined DataFrame
    if all_stocks.empty:
        all_stocks = df_renamed
    else:
        all_stocks = all_stocks.merge(df_renamed, on='Date', how='outer')

# all_stocks now contains all the data with renamed columns and one 'Date' column
all_stocks.sort_values('Date', inplace=True)

# Check the result
print(all_stocks.head())

            Date  Open_Amazon  High_Amazon  Low_Amazon  Close_Amazon  \
12775 1962-01-02          NaN          NaN         NaN           NaN
12776 1962-01-03          NaN          NaN         NaN           NaN
12777 1962-01-04          NaN          NaN         NaN           NaN
12778 1962-01-05          NaN          NaN         NaN           NaN
12779 1962-01-08          NaN          NaN         NaN           NaN

       Adj Close_Amazon  Volume_Amazon Company_Amazon  Open_Apple  High_Apple  \
12775               NaN            NaN            NaN         NaN         NaN
12776               NaN            NaN            NaN         NaN         NaN
12777               NaN            NaN            NaN         NaN         NaN
12778               NaN            NaN            NaN         NaN         NaN
12779               NaN            NaN            NaN         NaN         NaN

       ...  Adj Close_Warner Bros Discovery  Volume_Warner Bros Discovery  \
12775  ...                              NaN                           NaN
12776  ...                              NaN                           NaN
12777  ...                              NaN                           NaN
12778  ...                              NaN                           NaN
12779  ...                              NaN                           NaN

       Company_Warner Bros Discovery  Open_Vanguard 500 High_Vanguard 500  \
12775                            NaN                NaN               NaN
12776                            NaN                NaN               NaN
12777                            NaN                NaN               NaN
12778                            NaN                NaN               NaN
12779                            NaN                NaN               NaN

       Low_Vanguard 500  Close_Vanguard 500  Adj Close_Vanguard 500  \
12775               NaN                 NaN                     NaN
12776               NaN                 NaN                     NaN
12777               NaN                 NaN                     NaN
12778               NaN                 NaN                     NaN
12779               NaN                 NaN                     NaN

       Volume_Vanguard 500  Company_Vanguard 500
12775                  NaN                   NaN
12776                  NaN                   NaN
12777                  NaN                   NaN
12778                  NaN                   NaN
12779                  NaN                   NaN

[5 rows x 85 columns]

/var/folders/7_/z9jxc0jj6fx4snlcjg1wby4r0000gn/T/ipykernel_2075/945722630.py:20: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  stock_df['Date'] = pd.to_datetime(stock_df['Date'])

In [303]:
def parse_dates(date):
    for fmt in ("%Y-%m-%d", "%m/%d/%y"):  # Add or adjust formats as needed
        try:
            return pd.to_datetime(date, format=fmt)
        except ValueError:
            continue
    return pd.NaT  # return Not a Time for unparseable formats

all_stocks['Date'] = all_stocks['Date'].apply(parse_dates)

## all_stocks table and it's statistics

In [304]:
# Code to check date columns

# 1. Check for NaT values:
# If you used errors='coerce' during the conversion, you can check for NaT values, which would indicate conversion failures.
# nat_counts = all_stocks['Date'].isna().sum()
# print(f"Number of NaT values in 'Date': {nat_counts}")

# 2. Check the range of dates:
# Look at the minimum and maximum values to ensure they are within expected bounds.
# print("Earliest date:", all_stocks['Date'].min())
# print("Latest date:", all_stocks['Date'].max())

# 3. Sample random dates:
# Random sampling of dates can give you a quick spot check to see if dates look correctly formatted.
# print(all_stocks['Date'].sample(10))

# 4. Validate with known dates:
# If you know certain dates should exist in the dataset, check those specifically.
# known_dates = ["1997-05-15", "2005-07-08"]  # Example dates you expect to find
# for date in known_dates:
#     if pd.to_datetime(date) not in all_stocks['Date'].values:
#         print(f"Date {date} is not found or incorrectly formatted.")
#     else:
#         print(f"Date {date} is correctly formatted.")

# 5. Check for duplicates:
# Ensuring that there are no duplicate dates which could suggest an issue with the conversion.
# duplicate_dates = all_stocks['Date'].duplicated().sum()
# print(f"Number of duplicate dates: {duplicate_dates}")

In [305]:
all_stocks.head()

,Date,Open_Amazon,High_Amazon,Low_Amazon,Close_Amazon,Adj Close_Amazon,Volume_Amazon,Company_Amazon,Open_Apple,High_Apple,...,Adj Close_Warner Bros Discovery,Volume_Warner Bros Discovery,Company_Warner Bros Discovery,Open_Vanguard 500,High_Vanguard 500,Low_Vanguard 500,Close_Vanguard 500,Adj Close_Vanguard 500,Volume_Vanguard 500,Company_Vanguard 500
12775,1962-01-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12776,1962-01-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12777,1962-01-04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12778,1962-01-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12779,1962-01-08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [306]:
all_stocks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15554 entries, 12775 to 10988
Data columns (total 85 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Date                                15554 non-null  datetime64[ns]
 1   Open_Amazon                         6648 non-null   float64
 2   High_Amazon                         6648 non-null   float64
 3   Low_Amazon                          6648 non-null   float64
 4   Close_Amazon                        6648 non-null   float64
 5   Adj Close_Amazon                    6648 non-null   float64
 6   Volume_Amazon                       6648 non-null   float64
 7   Company_Amazon                      6648 non-null   object
 8   Open_Apple                          10800 non-null  float64
 9   High_Apple                          10800 non-null  float64
 10  Low_Apple                           10800 non-null  float64
 11  Close_Apple                         10800 non-null  float64
 12  Adj Close_Apple                     10800 non-null  float64
 13  Volume_Apple                        10800 non-null  float64
 14  Company_Apple                       10800 non-null  object
 15  Open_AT&T                           10056 non-null  float64
 16  High_AT&T                           10056 non-null  float64
 17  Low_AT&T                            10056 non-null  float64
 18  Close_AT&T                          10056 non-null  float64
 19  Adj Close_AT&T                      10056 non-null  float64
 20  Volume_AT&T                         10056 non-null  float64
 21  Company_AT&T                        10056 non-null  object
 22  Open_Comcast                        10988 non-null  float64
 23  High_Comcast                        10988 non-null  float64
 24  Low_Comcast                         10988 non-null  float64
 25  Close_Comcast                       10988 non-null  float64
 26  Adj Close_Comcast                   10988 non-null  float64
 27  Volume_Comcast                      10988 non-null  float64
 28  Company_Comcast                     10988 non-null  object
 29  Open_Lions Gate Entertainment       6267 non-null   float64
 30  High_Lions Gate Entertainment       6267 non-null   float64
 31  Low_Lions Gate Entertainment        6267 non-null   float64
 32  Close_Lions Gate Entertainment      6267 non-null   float64
 33  Adj Close_Lions Gate Entertainment  6267 non-null   float64
 34  Volume_Lions Gate Entertainment     6267 non-null   float64
 35  Company_Lions Gate Entertainment    6267 non-null   object
 36  Open_Lions Gate                     1722 non-null   float64
 37  High_Lions Gate                     1722 non-null   float64
 38  Low_Lions Gate                      1722 non-null   float64
 39  Close_Lions Gate                    1722 non-null   float64
 40  Adj Close_Lions Gate                1722 non-null   float64
 41  Volume_Lions Gate                   1722 non-null   float64
 42  Company_Lions Gate                  1722 non-null   object
 43  Open_Netflix                        251 non-null    float64
 44  High_Netflix                        251 non-null    float64
 45  Low_Netflix                         251 non-null    float64
 46  Close_Netflix                       251 non-null    float64
 47  Adj Close_Netflix                   251 non-null    float64
 48  Volume_Netflix                      251 non-null    float64
 49  Company_Netflix                     251 non-null    object
 50  Open_Paramount Global               251 non-null    float64
 51  High_Paramount Global               251 non-null    float64
 52  Low_Paramount Global                251 non-null    float64
 53  Close_Paramount Global              251 non-null    float64
 54  Adj Close_Paramount Global          251 non-null    float64
 55  Volume_Paramount Global             251 non-null    float64
 56  Company_Paramount Global            251 non-null    object
 57  Open_Sony                           12774 non-null  float64
 58  High_Sony                           12774 non-null  float64
 59  Low_Sony                            12774 non-null  float64
 60  Close_Sony                          12774 non-null  float64
 61  Adj Close_Sony                      12774 non-null  float64
 62  Volume_Sony                         12774 non-null  float64
 63  Company_Sony                        12774 non-null  object
 64  Open_Walt Disney                    15553 non-null  float64
 65  High_Walt Disney                    15553 non-null  float64
 66  Low_Walt Disney                     15553 non-null  float64
 67  Close_Walt Disney                   15553 non-null  float64
 68  Adj Close_Walt Disney               15553 non-null  float64
 69  Volume_Walt Disney                  15553 non-null  float64
 70  Company_Walt Disney                 15553 non-null  object
 71  Open_Warner Bros Discovery          4599 non-null   float64
 72  High_Warner Bros Discovery          4599 non-null   float64
 73  Low_Warner Bros Discovery           4599 non-null   float64
 74  Close_Warner Bros Discovery         4599 non-null   float64
 75  Adj Close_Warner Bros Discovery     4599 non-null   float64
 76  Volume_Warner Bros Discovery        4599 non-null   float64
 77  Company_Warner Bros Discovery       4599 non-null   object
 78  Open_Vanguard 500                   3297 non-null   float64
 79  High_Vanguard 500                   3297 non-null   float64
 80  Low_Vanguard 500                    3297 non-null   float64
 81  Close_Vanguard 500                  3297 non-null   float64
 82  Adj Close_Vanguard 500              3297 non-null   float64
 83  Volume_Vanguard 500                 3297 non-null   float64
 84  Company_Vanguard 500                3297 non-null   object
dtypes: datetime64[ns](1), float64(72), object(12)
memory usage: 10.2+ MB

In [307]:
all_stocks.dtypes[6]

/var/folders/7_/z9jxc0jj6fx4snlcjg1wby4r0000gn/T/ipykernel_2075/979003749.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  all_stocks.dtypes[6]

dtype('float64')

In [308]:
all_stocks.isnull().sum()

Date                          0
Open_Amazon                8906
High_Amazon                8906
Low_Amazon                 8906
Close_Amazon               8906
                          ...
Low_Vanguard 500          12257
Close_Vanguard 500        12257
Adj Close_Vanguard 500    12257
Volume_Vanguard 500       12257
Company_Vanguard 500      12257
Length: 85, dtype: int64

In [309]:
all_stocks.isnull().mean()

Date                      0.000000
Open_Amazon               0.572586
High_Amazon               0.572586
Low_Amazon                0.572586
Close_Amazon              0.572586
                            ...
Low_Vanguard 500          0.788029
Close_Vanguard 500        0.788029
Adj Close_Vanguard 500    0.788029
Volume_Vanguard 500       0.788029
Company_Vanguard 500      0.788029
Length: 85, dtype: float64

In [310]:
all_stocks.nunique()

Date                      15554
Open_Amazon                5919
High_Amazon                5875
Low_Amazon                 5879
Close_Amazon               6017
                          ...
Low_Vanguard 500           2983
Close_Vanguard 500         3020
Adj Close_Vanguard 500     3213
Volume_Vanguard 500        3212
Company_Vanguard 500          1
Length: 85, dtype: int64

In [311]:
all_stocks.value_counts()

Date        Open_Amazon  High_Amazon  Low_Amazon  Close_Amazon  Adj Close_Amazon  Volume_Amazon  Company_Amazon  Open_Apple  High_Apple  Low_Apple   Close_Apple  Adj Close_Apple  Volume_Apple  Company_Apple  Open_AT&T  High_AT&T  Low_AT&T  Close_AT&T  Adj Close_AT&T  Volume_AT&T  Company_AT&T  Open_Comcast  High_Comcast  Low_Comcast  Close_Comcast  Adj Close_Comcast  Volume_Comcast  Company_Comcast  Open_Lions Gate Entertainment  High_Lions Gate Entertainment  Low_Lions Gate Entertainment  Close_Lions Gate Entertainment  Adj Close_Lions Gate Entertainment  Volume_Lions Gate Entertainment  Company_Lions Gate Entertainment  Open_Lions Gate  High_Lions Gate  Low_Lions Gate  Close_Lions Gate  Adj Close_Lions Gate  Volume_Lions Gate  Company_Lions Gate  Open_Netflix  High_Netflix  Low_Netflix  Close_Netflix  Adj Close_Netflix  Volume_Netflix  Company_Netflix  Open_Paramount Global  High_Paramount Global  Low_Paramount Global  Close_Paramount Global  Adj Close_Paramount Global  Volume_Paramount Global  Company_Paramount Global  Open_Sony  High_Sony   Low_Sony   Close_Sony  Adj Close_Sony  Volume_Sony  Company_Sony  Open_Walt Disney  High_Walt Disney  Low_Walt Disney  Close_Walt Disney  Adj Close_Walt Disney  Volume_Walt Disney  Company_Walt Disney  Open_Warner Bros Discovery  High_Warner Bros Discovery  Low_Warner Bros Discovery  Close_Warner Bros Discovery  Adj Close_Warner Bros Discovery  Volume_Warner Bros Discovery  Company_Warner Bros Discovery  Open_Vanguard 500  High_Vanguard 500  Low_Vanguard 500  Close_Vanguard 500  Adj Close_Vanguard 500  Volume_Vanguard 500  Company_Vanguard 500
2022-10-17  110.110001   114.190002   110.089996  113.790001    113.790001        62782000.0     Amazon          141.070007  142.899994  140.270004  142.410004   141.570145       85250900.0    Apple          15.140000  15.400000  15.08     15.310000   14.346279       44240700.0   AT&T          30.469999     30.959999     30.400000    30.820000      29.940454          29109000.0      Comcast          7.08                           7.560                          7.080                         7.40                            7.40                                813400.0                         Lions Gate Entertainment          6.85             7.155            6.850           7.00              7.00                  1030300.0          Lions Gate          234.410004    249.919998    234.399994   245.100006     245.100006         21057800.0      Netflix          19.160000              19.629999              18.950001             19.290001               18.698811                   9154000.0                Paramount Global          65.070000  66.339996   65.070000  66.089996   66.089996       897500.0     Sony          96.379997         97.970001         96.260002        97.330002          97.330002              7083800.0           Walt Disney          12.57                       12.64                       12.28                      12.32                        12.32                            21358100.0                    Warner Bros Discovery          334.570007         338.100006         334.459991        337.000000          331.446381              3889500.0            Vanguard_500_Historical    1
2023-06-23  129.110001   130.839996   128.279999  129.330002    129.330002        71855200.0     Amazon          185.550003  187.559998  185.009995  186.679993   186.428238       53079300.0    Apple          15.630000  15.730000  15.42     15.450000   14.894808       37372800.0   AT&T          40.320000     40.509998     39.939999    40.090000      39.550697          19048300.0      Comcast          8.75                           8.845                          8.615                         8.71                            8.71                                2474500.0                        Lions Gate Entertainment          8.15             8.290            8.080           8.19              8.19                  3932500.0          Lions Gate          418.589996    425.820007    417.730011   424.019989     424.019989         8293900.0       Netflix          15.350000              15.670000              15.330000             15.360000               15.302558                   8500700.0                Paramount Global          91.239998  91.489998   90.800003  91.139999   91.139999       1150100.0    Sony          88.019997         88.400002         87.610001        88.099998          88.099998              13538000.0          Walt Disney          11.94                       11.97                       11.67                      11.79                        11.79                            57381300.0                    Warner Bros Discovery          399.329987         401.279999         398.929993        399.609985          396.532715              4205300.0            Vanguard_500_Historical    1
2023-06-05  123.360001   125.800003   123.029999  125.300003    125.300003        47950100.0     Amazon          182.630005  184.949997  178.039993  179.580002   179.337830       121946500.0   Apple          15.330000  15.490000  15.25     15.390000   14.836965       39528300.0   AT&T          39.279999     39.840000     39.220001    39.790001      39.254730          24043000.0      Comcast          10.11                          10.180                         9.700                         9.77                            9.77                                557000.0                         Lions Gate Entertainment          9.51             9.590            9.120           9.18              9.18                  639100.0           Lions Gate          400.470001    413.859985    400.149994   403.540009     403.540009         7247400.0       Netflix          15.290000              15.540000              15.000000             15.130000               15.028070                   12354500.0               Paramount Global          98.989998  99.099998   98.389999  98.500000   98.500000       672400.0     Sony          91.199997         91.760002         89.440002        91.000000          91.000000              18506700.0          Walt Disney          11.75                       11.88                       11.47                      11.63                        11.63                            15053800.0                    Warner Bros Discovery          393.540009         394.769989         391.790009        392.500000          389.477509              3481200.0            Vanguard_500_Historical    1
2023-06-06  125.070000   127.400002   125.000000  126.610001    126.610001        45695200.0     Amazon          179.970001  180.119995  177.429993  179.210007   178.968338       64848400.0    Apple          15.460000  15.750000  15.36     15.670000   15.106903       39037200.0   AT&T          39.930000     40.009998     39.270000    39.459999      38.929169          14302900.0      Comcast          9.76                           10.060                         9.530                         9.86                            9.86                                705200.0                         Lions Gate Entertainment          9.13             9.450            8.970           9.24              9.24                  830900.0           Lions Gate          405.000000    405.119995    396.929993   399.290009     399.290009         4991500.0       Netflix          15.040000              16.070000              15.000000             15.790000               15.683624                   12253400.0               Paramount Global          99.000000  100.239998  98.790001  100.050003  100.050003      754100.0     Sony          91.099998         92.510002         91.019997        92.160004          92.160004              12109100.0          Walt Disney          11.54                       12.20                       11.54                      12.10                        12.10                            18359800.0                    Warner Bros Discovery          392.049988         393.790009         391.410004        393.309998          390.281250              2894700.0            Vanguard_500_Historical    1
2023-06-07  127.010002   127.370003   120.629997  121.230003    121.230003        95663300.0     Amazon          178.440002  181.210007  177.320007  177.820007   177.580200       61944600.0    Apple          15.630000  16.120001  15.57     16.100000   15.521451       43584200.0   AT&T          39.500000     40.470001     39.439999    40.349998      39.807198          18455900.0      Comcast          9.98                           10.490                         9.980                         10.16                           10.16                               688700.0                         Lions Gate Entertainment          9.42             9.860            9.395           9.50              9.50                  955700.0           Lions Gate          410.429993    418.950012    399.230011   399.769989     399.769989         11932400.0      Netflix          15.830000              17.190001              15.760000             16.400000               16.289515                   28373600.0               Paramount Global          98.300003  98.800003   97.629997  97.680000   97.680000       736100.0     Sony          92.779999         93.080002         91.860001        92.519997          92.519997              11082400.0          Walt Disney          12.12                       13.34                       12.12                      13.12                        13.12                            47243100.0                    Warner Bros Discovery          393.670013         394.760010         391.540009        392.019989          389.001160              3942900.0            Vanguard_500_Historical    1
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                ..
2023-02-23  96.120003    96.430000    93.669998   95.820000     95.820000         48467000.0     Amazon          150.089996  150.339996  147.240005  149.399994   148.992432       48394200.0    Apple          19.420000  19.580000  19.26     19.350000   18.393799       24845800.0   AT&T          38.029999     38.139999     37.439999    37.689999      36.899288          17699200.0      Comcast          10.94                          11.010                         10.595                        10.91                           10.91                               888400.0                         Lions Gate Entertainment          10.15            10.340           9.930           10.27             10.27                 813500.0           Lions Gate          331.230011    331.279999    314.299988   323.649994     323.649994         13238700.0      Netflix          23.370001              23.700001              22.820000             23.440001               23.002285                   10965500.0               Paramount Global          83.139999  83.239998   82.040001  82.680000   82.680000       573000.0     Sony          101.449997        102.050003        99.610001        101.730003         101.730003             10974800.0          Walt Disney          15.43                       15.79                       15.29                      15.73                        15.73                            27591400.0                    Warner Bros Discovery          369.070007         369.570007         364.130005        368.170013          363.836823              2867200.0            Vanguard_500_Historical    1
2023-02-24  93.529999    94.139999    92.320000   93.500000     93.500000         57053800.0     Amazon          147.110001  147.190002  145.720001  146.710007   146.309784       55469600.0    Apple          19.260000  19.270000  18.98     19.240000   18.289234       29138100.0   AT&T          37.009998     37.299999     36.889999    37.000000      36.223770          18159200.0      Comcast          10.52                          10.800                         10.415                        10.50                           10.50                               786900.0                         Lions Gate Entertainment          9.98             10.115           9.765           9.87              9.87                  826700.0           Lions Gate          319.299988    321.500000    314.519989   317.149994     317.149994         6830700.0       Netflix          22.650000              22.840000              21.799999             22.299999               21.883570                   13419000.0               Paramount Global          82.709999  83.120003   82.129997  82.709999   82.709999       868300.0     Sony          99.529999         100.430000        98.959999        100.300003         100.300003             8523000.0           Walt Disney          15.31                       16.24                       15.15                      15.55                        15.55                            38611600.0                    Warner Bros Discovery          363.309998         365.029999         361.730011        364.230011          359.943176              4055000.0            Vanguard_500_Historical    1
2023-02-27  94.279999    94.779999    93.139999   93.760002     93.760002         47470300.0     Amazon          147.710007  149.169998  147.449997  147.919998   147.516479       44998500.0    Apple          19.299999  19.340000  19.01     19.030001   18.089613       22981100.0   AT&T          37.250000     37.570000     37.119999    37.349998      36.566422          17514600.0      Comcast          10.64                          10.785                         10.620                        10.66                           10.66                               856500.0                         Lions Gate Entertainment          9.95             10.105           9.950           10.03             10.03                 666200.0           Lions Gate          323.869995    330.000000    322.119995   323.029999     323.029999         6142600.0       Netflix          22.440001              22.700001              21.940001             22.090000               21.677494                   11372000.0               Paramount Global          83.900002  84.489998   83.339996  83.349998   83.349998       716200.0     Sony          100.730003        101.470001        100.059998       100.449997         100.449997             6641200.0           Walt Disney          15.55                       16.34                       15.55                      15.94                        15.94                            20752400.0                    Warner Bros Discovery          367.489990         368.769989         364.589996        365.489990          361.188293              3300100.0            Vanguard_500_Historical    1
2023-02-28  93.139999    94.690002    92.919998   94.230003     94.230003         43959300.0     Amazon          147.050003  149.080002  146.830002  147.410004   147.007874       50547000.0    Apple          19.020000  19.030001  18.84     18.910000   17.975542       34154800.0   AT&T          37.020000     37.400002     36.820000    37.169998      36.390198          24474300.0      Comcast          10.66                          10.850                         10.455                        10.61                           10.61                               2600800.0                        Lions Gate Entertainment          10.03            10.170           9.800           9.95              9.95                  1010300.0          Lions Gate          323.700012    327.619995    321.170013   322.130005     322.130005         3676100.0       Netflix          22.190001              22.190001              21.209999             21.420000               21.020004                   13354200.0               Paramount Global          83.680000  84.339996   83.449997  83.580002   83.580002       513300.0     Sony          100.449997        100.750000        99.570000        99.610001          99.610001              8233700.0           Walt Disney          15.86                       16.32                       15.46                      15.62                        15.62                            22523200.0                    Warner Bros Discovery          365.010010         366.859985         364.049988        364.109985          359.824554              3022200.0            Vanguard_500_Historical    1
2023-10-13  132.979996   133.309998   128.949997  129.789993    129.789993        45786600.0     Amazon          181.419998  181.929993  178.139999  178.850006   178.850006       51427100.0    Apple          14.480000  14.630000  14.32     14.360000   14.360000       34104500.0   AT&T          43.900002     44.070000     43.509998    43.810001      43.810001          16559100.0      Comcast          7.83                           7.900                          7.590                         7.87                            7.87                                985700.0                         Lions Gate Entertainment          7.14             7.270            6.985           7.25              7.25                  648400.0           Lions Gate          355.640015    358.929993    352.049988   355.679993     355.679993         6312600.0       Netflix          11.730000              12.010000              11.710000             11.900000               11.900000                   8957500.0                Paramount Global          85.750000  85.849998   84.889999  85.150002   85.150002       560200.0     Sony          83.940002         84.580002         83.379997        84.349998          84.349998              10808000.0          Walt Disney          10.29                       10.45                       10.15                      10.37                        10.37                            15401300.0                    Warner Bros Discovery          399.809998         400.959991         394.959991        396.420013          396.420013              3769800.0            Vanguard_500_Historical    1
Name: count, Length: 250, dtype: int64

In [312]:
all_stocks.memory_usage(deep=True)

Index                     124432
Date                      124432
Open_Amazon               124432
High_Amazon               124432
Low_Amazon                124432
                           ...
Low_Vanguard 500          124432
Close_Vanguard 500        124432
Adj Close_Vanguard 500    124432
Volume_Vanguard 500       124432
Company_Vanguard 500      629608
Length: 86, dtype: int64

In [313]:
#Descriptive Statistics for All Stocks.
print(all_stocks.describe())

                                Date  Open_Amazon  High_Amazon   Low_Amazon  \
count                          15554  6648.000000  6648.000000  6648.000000
mean   1992-12-01 11:34:37.973511680    33.465443    33.868688    33.026142
min              1962-01-02 00:00:00     0.070313     0.072396     0.065625
25%              1977-07-12 06:00:00     2.022719     2.063875     1.989750
50%              1992-11-26 00:00:00     6.857250     6.960000     6.766000
75%              2008-05-05 18:00:00    42.573249    42.694751    42.343500
max              2023-10-16 00:00:00   187.199997   188.654007   184.839493
std                              NaN    49.394337    49.975037    48.752435

       Close_Amazon  Adj Close_Amazon  Volume_Amazon    Open_Apple  \
count   6648.000000       6648.000000   6.648000e+03  10800.000000
mean      33.454436         33.454436   1.408481e+08     19.244714
min        0.069792          0.069792   9.744000e+06      0.049665
25%        2.024625          2.024625   6.752550e+07      0.293248
50%        6.867750          6.867750   1.044960e+08      0.504464
75%       42.501750         42.501750   1.593305e+08     18.589733
max      186.570496        186.570496   2.086584e+09    196.240005
std       49.361953         49.361953   1.392975e+08     40.394744

         High_Apple     Low_Apple  ...  Low_Warner Bros Discovery  \
count  10800.000000  10800.000000  ...                4599.000000
mean      19.458728     19.038269  ...                  22.363297
min        0.049665      0.049107  ...                   5.120082
25%        0.300865      0.285714  ...                  12.835432
50%        0.513393      0.495536  ...                  22.450001
75%       18.764554     18.463214  ...                  28.520000
max      198.229996    195.279999  ...                  74.510002
std       40.855417     39.963585  ...                  10.404459

       Close_Warner Bros Discovery  Adj Close_Warner Bros Discovery  \
count                  4599.000000                      4599.000000
mean                     22.708170                        22.708170
min                       5.247828                         5.247828
25%                      13.132345                        13.132345
50%                      22.770000                        22.770000
75%                      28.943685                        28.943685
max                      77.269997                        77.269997
std                      10.550216                        10.550216

       Volume_Warner Bros Discovery  Open_Vanguard 500  High_Vanguard 500  \
count                  4.599000e+03        3297.000000        3297.000000
mean                   5.786590e+06         236.422612         237.659721
min                    3.465850e+05          99.139999         101.860001
25%                    2.498208e+06         164.639999         165.339996
50%                    3.587377e+06         216.509995         217.539993
75%                    5.606570e+06         300.739990         301.940002
max                    1.580825e+08         440.579987         441.260010
std                    7.411188e+06          94.255173          94.863448

       Low_Vanguard 500  Close_Vanguard 500  Adj Close_Vanguard 500  \
count       3297.000000         3297.000000             3297.000000
mean         235.053161          236.451134              216.370620
min           98.239998          100.339996               79.068352
25%          163.899994          164.800003              137.772903
50%          215.410004          216.570007              192.899750
75%          298.790009          300.839996              284.298889
max          437.660004          439.250000              426.925934
std           93.599071           94.265663              100.237887

       Volume_Vanguard 500
count         3.297000e+03
mean          2.530315e+06
min           8.600000e+03
25%           9.303000e+05
50%           2.050500e+06
75%           3.402300e+06
max           2.466930e+07
std           2.355397e+06

[8 rows x 73 columns]

---------------------

# Modeling Economic Indicators

In [314]:
#Renaming a column in the Unemployment table
Unemployment_Rate.rename(columns={'LRUNTTTTUSQ156S': 'Unemployment_rate'}, inplace=True)
# Unemployment_Rate.head()

# Convert the dictionaries to DataFrames
GDP = pd.DataFrame(GDP)
Unemployment = pd.DataFrame(Unemployment_Rate)

# Merge the DataFrames on the 'DATE' column
Economic_Indicators = GDP.merge(Unemployment, on='DATE', how='outer')

Economic_Indicators.tail()
# Economic_Indicators.to_csv('file_name.csv')

           DATE        GDP  Unemployment_rate
301  2022-04-01  25544.273           3.600000
302  2022-07-01  25994.639           3.566667
303  2022-10-01  26408.405           3.600000
304  2023-01-01  26813.601           3.500000
305  2023-04-01  27063.012           3.566667

In [315]:
#Descriptive Statistics for All Stocks.
print(Economic_Indicators.describe())

                GDP  Unemployment_rate
count    306.000000         254.000000
mean    7024.590363           5.934121
std     7225.574141           1.682763
min      243.164000           3.400000
25%      798.045750           4.766667
50%     4262.527500           5.650000
75%    12065.473000           6.991667
max    27063.012000          12.966667

# Cleaning all IMDB

<a name="_page0_x69.69_y423.22"></a>**IMDb Dataset Legend**

<Details>

Each dataset is contained in a gzipped, tab-separated-values (TSV) formatted file in the UTF-8 character set. The first line in each file contains headers that describe what is in each column. A â€˜\Nâ€™ is used to denote that a particular field is missing or null for that title/name. The available datasets are as follows:

<a name="_page0_x60.71_y555.04"></a>**title.akas.tsv.gz**

- titleId (string) - a tconst, an alphanumeric unique identifier of the title
- ordering (integer) â€“ a number to uniquely identify rows for a given titleId
- title (string) â€“ the localized title
- region (string) - the region for this version of the title
- language (string) - the language of the title
- types (array) - Enumerated set of attributes for this alternative title. One or more of the following: "alternative", "dvd", "festival", "tv", "video", "working", "original", "imdbDisplay". New values may be added in the future without warning
- attributes (array) - Additional terms to describe this alternative title, not enumerated
- isOriginalTitle (boolean) â€“ 0: not original title; 1: original title <a name="_page1_x60.71_y183.54"></a>**title.basics.tsv.gz**
- tconst (string) - alphanumeric unique identifier of the title
- titleType (string) â€“ the type/format of the title (e.g. movie, short, tvseries, tvepisode, video, etc)
- primaryTitle (string) â€“ the more popular title / the title used by the filmmakers on promotional materials at the point of release
- originalTitle (string) - original title, in the original language
- isAdult (boolean) - 0: non-adult title; 1: adult title
- startYear (YYYY) â€“ represents the release year of a title. In the case of TV Series, it is the series start year ![](Aspose.Words.6ef9d709-0a24-4a63-90ff-a7a4701c44f5.002.png) endYear (YYYY) â€“ TV Series end year. â€˜\Nâ€™ for all other title types ![](Aspose.Words.6ef9d709-0a24-4a63-90ff-a7a4701c44f5.003.png) runtimeMinutes â€“ primary runtime of the title, in minutes ![](Aspose.Words.6ef9d709-0a24-4a63-90ff-a7a4701c44f5.004.png) genres (string array) â€“ includes up to three genres associated with the title

<a name="_page1_x60.71_y549.05"></a>**title.crew.tsv.gz**

- tconst (string) - alphanumeric unique identifier of the title
- directors (array of nconsts) - director(s) of the given title
- writers (array of nconsts) â€“ writer(s) of the given title

<a name="_page1_x60.71_y680.87"></a>**title.episode.tsv.gz**

- tconst (string) - alphanumeric identifier of episode
- parentTconst (string) - alphanumeric identifier of the parent TV Series
- seasonNumber (integer) â€“ season number the episode belongs to
- episodeNumber (integer) â€“ episode number of the tconst in the TV series

<a name="_page2_x60.71_y99.65"></a>**title.principals.tsv.gz**

- tconst (string) - alphanumeric unique identifier of the title
- ordering (integer) â€“ a number to uniquely identify rows for a given titleId
- nconst (string) - alphanumeric unique identifier of the name/person
- category (string) - the category of job that person was in
- job (string) - the specific job title if applicable, else '\N'
- characters (string) - the name of the character played if applicable, else '\N'

<a name="_page2_x60.71_y321.35"></a>**title.ratings.tsv.gz**

- tconst (string) - alphanumeric unique identifier of the title
- averageRating â€“ weighted average of all the individual user ratings
- numVotes - number of votes the title has received

<a name="_page2_x60.71_y453.18"></a>**name.basics.tsv.gz**

- nconst (string) - alphanumeric unique identifier of the name/person
- primaryName (string)â€“ name by which the person is most often credited
- birthYear â€“ in YYYY format
- deathYear â€“ in YYYY format if applicable, else '\N'
- primaryProfession (array of strings)â€“ the top-3 professions of the person
- knownForTitles (array of tconsts) â€“ titles the person is known for

In [316]:
# Changes to the IMBb_Basics and IMDb_Title_Akas tables columns to strings.

# Convert the problematic columns to string data types
column_name_4_IMDb_Basics = IMDb_Basics.columns[4]  # Replace with actual column name
column_name_7_IMDb_Title_Akas = IMDb_Title_Akas.columns[7]  # Replace with actual column name

IMDb_Basics[column_name_4_IMDb_Basics] = IMDb_Basics[column_name_4_IMDb_Basics].astype(str)
IMDb_Title_Akas[column_name_7_IMDb_Title_Akas] = IMDb_Title_Akas[column_name_7_IMDb_Title_Akas].astype(str)

### 1. Cleaning IMDB_Basics
-----------

In [317]:
# Converting the data to different data types

IMDb_Basics['tconst'] = IMDb_Basics['tconst'].astype(str)
IMDb_Basics['primaryTitle'] = IMDb_Basics['primaryTitle'].astype(str)
IMDb_Basics['originalTitle'] = IMDb_Basics['originalTitle'].astype(str)
IMDb_Basics['isAdult'] = IMDb_Basics['isAdult'].astype(bool)

# Handle 'startYear'
IMDb_Basics['startYear'] = IMDb_Basics['startYear'].replace('\\N', np.nan)
IMDb_Basics['startYear'] = IMDb_Basics['startYear'].astype('float').astype('Int64')

# Handle 'endYear'
IMDb_Basics['endYear'] = IMDb_Basics['endYear'].replace('\\N', np.nan)
IMDb_Basics['endYear'] = IMDb_Basics['endYear'].astype('float').astype('Int64')

IMDb_Basics['runtimeMinutes'] = IMDb_Basics['runtimeMinutes'].astype(str)
IMDb_Basics['genres'] = IMDb_Basics['genres'].astype(str)

In [318]:
print(IMDb_Basics.dtypes)

tconst            object
titleType         object
primaryTitle      object
originalTitle     object
isAdult             bool
startYear          Int64
endYear            Int64
runtimeMinutes    object
genres            object
dtype: object

In [319]:
IMDb_Basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,True,1894,<NA>,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,True,1892,<NA>,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,True,1892,<NA>,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,True,1892,<NA>,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,True,1893,<NA>,1,"Comedy,Short"

### 2. Cleaning IMDB_name_Basic
-----------

In [320]:
# Inspecting how the df looks.
IMDb_Name_Basics.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0031983,tt0053137,tt0050419"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,music_department","tt0056404,tt0049189,tt0054452,tt0057345"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0072562,tt0080455,tt0077975,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0083922,tt0050976,tt0050986,tt0069467"

In [321]:
# Inspecting the data types
print(IMDb_Name_Basics.dtypes)

nconst               object
primaryName          object
birthYear            object
deathYear            object
primaryProfession    object
knownForTitles       object
dtype: object

In [322]:
# Convert string columns
IMDb_Name_Basics['nconst'] = IMDb_Name_Basics['nconst'].astype(str)
IMDb_Name_Basics['primaryName'] = IMDb_Name_Basics['primaryName'].astype(str)
IMDb_Name_Basics['primaryProfession'] = IMDb_Name_Basics['primaryProfession'].astype(str)
IMDb_Name_Basics['knownForTitles'] = IMDb_Name_Basics['knownForTitles'].astype(str)

# Convert birthYear and deathYear to integer (with NA support)
# First, replace '\N' with NaN
IMDb_Name_Basics['birthYear'].replace('\\N', pd.NA, inplace=True)
IMDb_Name_Basics['deathYear'].replace('\\N', pd.NA, inplace=True)

# Convert to Int64 (capital "I" to support NaN)
IMDb_Name_Basics['birthYear'] = IMDb_Name_Basics['birthYear'].astype('Int64')
IMDb_Name_Basics['deathYear'] = IMDb_Name_Basics['deathYear'].astype('Int64')

In [323]:
# Finally looking at the changed data types
print(IMDb_Name_Basics.dtypes)

nconst               object
primaryName          object
birthYear             Int64
deathYear             Int64
primaryProfession    object
knownForTitles       object
dtype: object

### 3. Cleaning IMDb_Ratings DF
------------

In [324]:
IMDb_Ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000003            6.5      1892
3  tt0000004            5.5       178
4  tt0000005            6.2      2679

In [325]:
# Inspecting the data types
IMDb_Ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

### 4. Cleaning IMDb_Title_Akas
-----------

In [326]:
IMDb_Title_Akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,ÐšÐ°Ñ€Ð¼ÐµÐ½ÑÑ–Ñ‚Ð°,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tÃ¡nc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,ÎšÎ±ÏÎ¼ÎµÎ½ÏƒÎ¯Ï„Î±,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,ÐšÐ°Ñ€Ð¼ÐµÐ½ÑÐ¸Ñ‚Ð°,RU,\N,imdbDisplay,\N,0

In [327]:
IMDb_Title_Akas.dtypes

titleId            object
ordering            int64
title              object
region             object
language           object
types              object
attributes         object
isOriginalTitle    object
dtype: object

### 5. Cleaning IMDb_Title_Crew
-----------

In [328]:
IMDb_Title_Crew.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

In [329]:
IMDb_Title_Crew.dtypes

tconst       object
directors    object
writers      object
dtype: object

### 6. Cleaning IMDb_Episode
-----------

In [330]:
Title_Episode.head(20)

       tconst parentTconst seasonNumber episodeNumber
0   tt0041951    tt0041038            1             9
1   tt0042816    tt0989125            1            17
2   tt0042889    tt0989125           \N            \N
3   tt0043426    tt0040051            3            42
4   tt0043631    tt0989125            2            16
5   tt0043693    tt0989125            2             8
6   tt0043710    tt0989125            3             3
7   tt0044093    tt0959862            1             6
8   tt0044668    tt0044243            2            16
9   tt0044901    tt0989125            3            46
10  tt0045519    tt0989125            4            11
11  tt0045960    tt0044284            2             3
12  tt0046135    tt0989125            4             5
13  tt0046150    tt0341798           \N            \N
14  tt0046855    tt0046643            1             4
15  tt0046864    tt0989125            5            20
16  tt0047810    tt0914702            3            36
17  tt0047852    tt0047745            1            15
18  tt0047858    tt0046637            2             9
19  tt0047961    tt0989125            6             5

### 7. Cleaning IMDb_Principals
-----------

In [331]:
Title_Principals.head(20)

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N
5,tt0000003,1,nm0721526,director,\N,\N
6,tt0000003,2,nm1770680,producer,producer,\N
7,tt0000003,3,nm1335271,composer,\N,\N
8,tt0000003,4,nm5442200,editor,\N,\N
9,tt0000004,1,nm0721526,director,\N,\N
10,tt0000004,2,nm1335271,composer,\N,\N
11,tt0000005,1,nm0443482,actor,\N,"[""Blacksmith""]"
12,tt0000005,2,nm0653042,actor,\N,"[""Assistant""]"
13,tt0000005,3,nm0005690,director,\N,\N
14,tt0000005,4,nm0249379,producer,producer,\N
15,tt0000006,1,nm0005690,director,\N,\N
16,tt0000007,1,nm0179163,actor,\N,\N
17,tt0000007,2,nm0183947,actor,\N,\N
18,tt0000007,3,nm0005690,director,\N,\N
19,tt0000007,4,nm0374658,director,\N,\N

# Testing

In [332]:
IMDb_Basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,True,1894,<NA>,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,True,1892,<NA>,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,True,1892,<NA>,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,True,1892,<NA>,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,True,1893,<NA>,1,"Comedy,Short"

In [333]:
IMDb_Ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000003            6.5      1892
3  tt0000004            5.5       178
4  tt0000005            6.2      2679

In [334]:
os.chdir('/Users/shreyashgupta/Library/CloudStorage/OneDrive-UniversityofArkansas/MSEA/ECON 5813 - Economic Analytics I/Project Proposal/Data/Gross Data')
January_2023 = pd.read_csv('January 2023.csv')
January_2023.head(10)

,Rank,Release,Gross,Theaters,Total Gross,Release Date,Distributor
0,1.0,Avatar: The Way of Water,"$222,528,552","4,340","$684,075,767",16-Dec,20th Century Studios
1,2.0,Puss in Boots: The Last Wish,"$86,503,985","4,121","$185,535,345",21-Dec,Universal Pictures
2,3.0,M3GAN,"$83,058,490","3,628","$95,043,350",6-Jan,Universal Pictures
3,4.0,A Man Called Otto,"$47,561,111","3,957","$64,267,657",30-Dec,Columbia Pictures
4,5.0,Plane,"$26,138,048","3,060","$32,111,181",13-Jan,Lions Gate Films
5,6.0,Missing,"$18,575,107","3,025","$32,502,025",20-Jan,Sony Pictures Entertainment (SPE)
6,7.0,Black Panther: Wakanda Forever,"$16,656,634","4,396","$453,829,060",11-Nov,Walt Disney Studios Motion Pictures
7,8.0,Pathaan,"$10,822,853",697,"$17,487,476",25-Jan,Yash Raj Films USA Inc.
8,9.0,Whitney Houston: I Wanna Dance with Somebody,"$10,224,940","3,625","$23,708,080",23-Dec,TriStar Pictures
9,10.0,The Whale,"$9,807,231","1,721","$17,463,630",9-Dec,A24

# 4. Cleaning Movies_Revenues dataset

In [335]:
# The Gross Revenue Dataset
print(Movie_Revenues.head())

        Rank             Release      Gross Theaters Total Gross Release Date  \
7618   115.0  Chimes at Midnight   $18,111         4   $126,724    1900-01-01
7001   115.0            Yosemite   $11,090         4    $13,931    1900-01-01
6941    59.0      Ho Mann Jahaan  $201,591        23   $208,611    1900-01-01
12413   74.0      Only Yesterday   $70,884        44   $453,243    1900-01-01
6197   122.0      Only Yesterday   $19,125        44   $453,243    1900-01-01

          Distributor       Date
7618      Janus Films 2016-03-01
7001   Monterey Media 2016-01-01
6941   Eros Worldwide 2016-01-01
12413           GKIDS 2016-02-01
6197            GKIDS 2016-04-01